Emacs.org
#+TITLE: Literal dotEmacs Framework II (def)
#+AUTHOR: Erik Almaraz (skribest)
#+PROPERTY: header-args:emacs-lisp :tangle no :mkdirp yes
#+STARTUP: show2levels

* Preface

** Header

#+begin_src emacs-lisp :tangle ./init.el
  ;;; init.el --- Emacs Initialization File  -*- lexical-binding: t; -*-
  ;; This file is auto generated by Emacs.org

  ;; Author: Erik Almaraz <erik@almarazlabs.com>
  ;; Maintainer: Erik Almaraz <erik@almarazlabs.com>
  ;; Created 2021-12-05 Sun
  ;; Version: 0.1
  ;; Keywords: Emacs, .emacs, init, Emacs Lisp
  ;; URL: https;//github.com/skribest/dotEmacs

  ;;; Commentary

  ;;; Introduction
  ;; The Next Generation Emacs Configuration - dotEmacs Framework (DEF)

  ;; This is brand-spankin-new configuration that I compiled this weekend. I originally setup my
  ;; Emacs configuration in this manner, the style which was inspired by Steve Yegge [1].
  ;; My Emacs passion was reignited by David Wilsons System Crafters YouTube channel, where
  ;; he presented his emacs-from-scratch series [2]. I then went through the exercise of setting
  ;; up a literal configuration based on Org Babel [3]. I tried this style for a month, however,
  ;; I found it was quite cumbersome when needing to revert... My Current approach of keeping config
  ;; files disparate, and letting init load in the needed files.

  ;; After switching back to my old environment, I realized the power of Org & Babel and how it allows
  ;; one to organize their code. I am going to revise my previous once again use org bable, but keep my
  ;; same style, i.e. Org Babel will write different "conf" files for different sections.

  ;;; References:

  ;;   [1] https://sites.google.com/site/steveyegge2/my-dot-emacs-file
  ;;   [2] https://github.com/daviwil/emacs-from-scratch
  ;;   [3] https://orgmode.org/worg/org-contrib/babel/intro.html

  ;;<=================================================================================================>


  ;; Code:


#+end_src

** Customizable (Global) Variables

#+begin_src emacs-lisp :tangle ./init.el

  ;;; Define Global variables
  (defgroup dotEmacs nil
    "The Next Generation Emacs Configuration."
    :group 'applications
    :version "0.1")

  (defcustom def/default-font-size 110
    "Global variable for font size."
    :type 'integer
    :group 'dotEmacs
    :version "0.1")

  (defcustom def/default-variable-font-size 110
    "Global variable for variable font size."
    :type 'integer
    :group 'dotEmacs
    :version "0.1")

  (defcustom def/default-font-family "Fira Code Retina"
    "Global variable for font family."
    :type 'string
    :group 'dotEmacs
    :version "0.1")  

  (defcustom def/default-variable-font-family "Iosevka Aile"
    "Global variable for variable font family."
    :type 'string
    :group 'dotEmacs
    :version "0.1")

  (defcustom def/work t
    "Global boolean variable for Windows work machine."
    :type 'boolean
    :group 'dotEmacs
    :version "0.1")

  (defcustom def/column-margin 101
    "Global customizable variable for fill column indicator."
    :type 'integer
    :group 'dotEmacs
    :version "0.1")

  (defcustom def/home-win-path "C:/Users/erik/AppData/Roaming/"
    "Global variable for Emacs HOME PATH for windows work machine."
    :type 'string
    :group 'dotEmacs
    :version "0.1")

  (defcustom def/win-app-path (concat def/home-win-path ".apps/")
    "Global variable for Emacs HOME PATH for windows work machine."
    :type 'string
    :group 'dotEmacs
    :version "0.1")  

  (defcustom def/lp-dir "~/.emacs.d/OrgFiles/Babel/"
    "Global variable for Org Bable Literate Programing files directory."
    :type 'string
    :group 'dotEmacs
    :version "0.1")

  (defcustom def/user-emacs-directory "~/.emacs.d/"
    "Global variable for Emacs Literal Configuration."
    :type 'string
    :group 'dotEmacs
    :version "0.1")

  (defcustom def/user-emacs-cache-directory "~/.cache/emacs/"
    "Global variable for Emacs user cache. Set when used in 
  conjunction with `no-littering'."
    :type 'string
    :group 'dotEmacs
    :version "0.1")

  (defcustom def/org-agenda-dir "~/.emacs.d/OrgFiles/Notes/"
    "Global variable for Org Agenda files directory."
    :type 'string
    :group 'dotEmacs
    :version "0.1")

  (defcustom def/org-roam-dir "~/.emacs.d/OrgFiles/Roam/"
    "Global variable for Org Roam files/database directory."
    :type 'string
    :group 'dotEmacs
    :version "0.1")

#+end_src

** Generate init.el

#+begin_src emacs-lisp :tangle ./init.el

  ;;; Emacs Configuration

  ;; Set directories that contain Emacs configuration files and load..
  (let (
        ;; Define variables here
        (confs "~/.emacs.d/conf/")
        (elisp "~/.emacs.d/elisp/")

        )
    ;; let body...

    ;; Add paths to `load-path'
    (add-to-list 'load-path confs)
    (add-to-list 'load-path elisp)

    ;; Load config files here...
    ;; Order matters!
    (load "system-settings-conf"      'noerror 'nomessage)
    (load "basic-ui-conf"             'noerror 'nomessage)
    (load "package-management-conf"   'noerror 'nomessage)
    (load "ui-conf"                   'noerror 'nomessage)
    (load "completion-framework-conf" 'noerror 'nomessage)
    (load "file-system-conf"          'noerror 'nomessage)
    (load "org-conf"                  'noerror 'nomessage)
    (load "babel-conf"                'noerror 'nomessage)
    (load "roam-conf"                 'noerror 'nomessage)
    (load "ide-conf"                  'noerror 'nomessage)
    (load "exploratory-packages-conf" 'noerror 'nomessage)

    ;; Load personal elisp utils/libraries here...
    ;; 
    (load "utils"   'noerror 'nomessage)
    ;;(load "sandbox" 'noerror 'nomessage)

    );; End of let


  ;;; Notes:
  ;; To add helper functions in Emacs setup
  ;; (add-hook 'after-init-hook #'qr/my-function)

#+end_src

* UI Configuration

** Generate early-init.el

Header

#+begin_src emacs-lisp :tangle ./early-init.el
  ;;; early-init.el --- Emacs Early Initilization File
  ;; This file is auto generated by Emacs.org

  ;; Author: Erik Almaraz <erik@almarazlabs.com>
  ;; Maintainer: Erik Almaraz <erik@almarazlabs.com>
  ;; Created 2021-12-05 Sun
  ;; Version: 0.1
  ;; Keywords: Emacs, .emacs, init, Emacs Lisp
  ;; URL: https;//github.com/skribest/emacs-config

  ;;; Commentary
  
  ;; Initialization sets up more "cleanly" when we set these fundamental UI
  ;; elements here in the early-init file [1]. In order to optimize initilization, we dial down
  ;; Emacs garbage collection [2], thereby directing resources to loading and initializing libraries,
  ;; this was inspired by David Wilson's Emacs configuration [3]

  ;;; References:

  ;;   [1] https://www.gnu.org/software/emacs/manual/html_node/emacs/Early-Init-File.html
  ;;   [2] https://www.gnu.org/software/emacs/manual/html_node/elisp/Garbage-Collection.html
  ;;   [3] https://config.daviwil.com/emacs

  ;;<=================================================================================================>


  ;;; Code:


#+end_src


Basic UI Settings - performance is best when they are set in the early-init.el

#+begin_src emacs-lisp :tangle ./early-init.el
  ;; The default is 800 kilobytes.  Measured in bytes.
  (setq gc-cons-threshold (* 50 1000 1000))

  (setq inhibit-startup-message t)

  (scroll-bar-mode -1)     ; Disable visible scrollbar
  (tool-bar-mode -1)       ; Disable the toolbar
  (tooltip-mode -1)        ; Disable tooltips
  (menu-bar-mode -1)       ; Disable the menu bar
  (set-fringe-mode 10)     ; Give some breathing room


  ;; Set up the visible bell
  (setq visible-bell nil
        ring-bell-function (lambda ()
                             (invert-face 'mode-line)
                             (run-with-timer 0.1 nil 'invert-face 'mode-line)))

  ;; Show column number in modeline and line numbers in buffers
  (column-number-mode)
  (global-display-line-numbers-mode t)

  ;; Set frame to fullscreen
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

  ;; Set frame transparency (only accepts integer values)
  (set-frame-parameter (selected-frame) 'alpha '(88 . 88))
  (add-to-list 'default-frame-alist `(alpha . ,'(88 . 88)))

#+end_src

