Emacs.org
** System Settings

File header and commentary..

#+begin_src emacs-lisp :tangle ./conf/system-settings-conf.el :mkdirp yes
  ;;; system-settings-conf.el --- Emacs System Specific Settings  -*- lexical-binding: t; -*-
  ;; This file is auto generated by Emacs.org

  ;; Author: Erik Almaraz <erik@almarazlabs.com>
  ;; Maintainer: Erik Almaraz <erik@almarazlabs.com>
  ;; Created 2021-12-05 Sun
  ;; Version: 0.1
  ;; Keywords: Emacs, .emacs, init, Emacs Lisp
  ;; URL: https;//github.com/skribest/emacs-config

  ;;; Commentary

  ;;; References:

  ;;   [1] 
  ;;   [2] 
  ;;   [3] 

  ;;<=================================================================================================>


  ;;; Code:


#+end_src

Operating system specific settings, basic setup for my Windows machine, setting up path to portable apps needed by Emacs.

#+begin_src emacs-lisp :tangle ./conf/system-settings-conf.el
;;; System Settings

;; Configure system specific PATHS.
(if (and (string-equal system-type "windows-nt") def/work)
    (let ((mypaths
           `(
             ,(concat def/win-app-path "Emacs/emacs-27.2-x86_64/bin")
             ,(concat def/win-app-path "MinGW/bin")
             ,(concat def/win-app-path "PortableGit/cmd")
             ,(concat def/win-app-path "Perl/perl/bin")
             ,(concat def/win-app-path "Python/python3.9.9")
             ,(concat def/win-app-path "MikTex/texmfs/install/miktex/bin/x64")
             ,(concat def/win-app-path "ImageMagick")
             ,(concat def/win-app-path "GnuPG/bin")
             ,(concat def/win-app-path "Hunspell/bin")
             )))
      (setenv "PATH" (mapconcat 'identity mypaths ";"))
      (setq exec-path (append mypaths (list "." exec-directory))
            def/default-font-size 90
            def/default-variable-font-size 90)))


;; Notes:
;; To add helper functions in Emacs setup
;; (add-hook 'after-init-hook #'ea/my-function)





#+end_src

Footer

#+begin_src emacs-lisp :tangle ./conf/system-settings-conf.el


  ;;; Footer


  ;;; system-settings-conf.el ends here
#+end_src

** Basic UI Configuration

Header & commentary

#+begin_src emacs-lisp :tangle ./conf/basic-ui-conf.el :mkdirp yes
  ;;; basic-ui-conf.el --- Emacs Basic UI Configuration  -*- lexical-binding: t; -*-
  ;; This file is auto generated by Emacs.org

  ;; Author: Erik Almaraz <erik@almarazlabs.com>
  ;; Maintainer: Erik Almaraz <erik@almarazlabs.com>
  ;; Created 2021-12-05 Sun
  ;; Version: 0.1
  ;; Keywords: Emacs, .emacs, init, Emacs Lisp
  ;; URL: https;//github.com/skribest/dotEmacs

  ;;; Commentary

  ;;; References:

  ;;   [1] 
  ;;   [2] 
  ;;   [3] 

  ;;<=================================================================================================>


  ;;; Code:


#+end_src

Configuration

#+begin_src emacs-lisp :tangle ./conf/basic-ui-conf.el

  ;;; Set column numbers only for certain modes 
  ;; See `early-init.el' for other basic ui configuration
  ;; Disable Line Numbers (per mode)
  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  treemacs-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))


  ;;; Font Configuration

  ;; Set the default face
  (set-face-attribute 'default nil
                      :font def/default-font-family ;;Fira Code Retina
                      :height def/default-font-size)

  ;; Set the fixed pitch face
  (set-face-attribute 'fixed-pitch nil
                      :font def/default-font-family ;;Fira Code Retina
                      :height def/default-font-size)

  ;; Set the variable pitch face
  (set-face-attribute 'variable-pitch nil
                      :font def/default-variable-font-family ;;Iosevka Aile (prev "Canterell")
                      :height def/default-variable-font-size
                      :weight 'regular)

#+end_src

Footer

#+begin_src emacs-lisp


;;; Footer


;;; basic-ui-conf.el ends here
#+end_src

** Package Management System

Code required in =early-init.el= to disable =package.el= from interfering with =straight=

#+begin_src emacs-lisp :tangle ./early-init.el

  ;; disable package.el -> use instead straight.el (better package management system)
  (setq package-enable-at-startup nil)

#+end_src

Header & Commentary

#+begin_src emacs-lisp :tangle ./conf/package-management-conf.el :mkdirp yes
  ;;; package-management-conf.el --- Package Management Configuration  -*- lexical-binding: t; -*-
  ;; This file is auto generated by Emacs.org

  ;; Author: Erik Almaraz <erik@almarazlabs.com>
  ;; Created 2021-12-05 Sun
  ;; Version: 0.1
  ;; Keywords: Emacs, .emacs, init, Emacs Lisp
  ;; URL: https;//github.com/skribest/dotEmacs

  ;;; Commentary

  ;;; References:

  ;;   [1] 
  ;;   [2] 
  ;;   [3] 

  ;;<=================================================================================================>


  ;;; Code:


#+end_src

Package Management with =straight=

#+begin_src emacs-lisp :tangle ./conf/package-management-conf.el

  ;;; Package Management with "straight.el"

  ;; Initialize `straight' (instead of `package')
  ;; This requires setting up some code in "early-init.el", see that
  ;; file for more information.

  ;; Boostrap `straight' and load helper package `straight-x' for
  ;; other useful commands.

  ;; Bootstrap straight.el
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el"
                           user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  ;; Load the helper package for commands such as 'straight-x-clean-unused-repos'
  (require 'straight-x)

#+end_src

Setup use with =use-package=

#+begin_src emacs-lisp :tangle ./conf/package-management-conf.el

  ;;; `use-package' Setup with `straight'

  ;; `use-package' initialization to use `straight.el' rather than its default
  ;; use of `package.el'
  ;; setup use-package to use straight.el rather than it's default use of package.el.
  (straight-use-package 'use-package)

  ;; Always enable straight.el with use-package
  (setq straight-use-package-by-default t)

#+end_src

Use =no-littering= to keep .emacs directory clean. Also, keep customization settings in a temporary file.

#+begin_src emacs-lisp :tangle ./conf/package-management-conf.el

  ;; Set up `no-littering' package to help keep directories where we edit files
  ;; and the Emacs configuration directory clean! It knows about a wide variety
  ;; of variables for built in Emacs features as well as those from community
  ;; packages so it can be much easier than finding and setting these variables
  ;; yourself.
  ;; Change the user-emacs-directory to keep unwanted things out of ~/.emacs.d
  (setq user-emacs-directory (expand-file-name def/user-emacs-cache-directory)
        url-history-file (expand-file-name "url/history" user-emacs-directory))

    ;;; Use no-littering to automatically set common paths to the new user-emacs-directory
  (use-package no-littering)

  ;; Keep customization settings in a temporary file
  (setq custom-file
        (if (boundp 'server-socket-dir)
            (expand-file-name "custom.el" server-socket-dir)
          (expand-file-name (format "emacs-custom-%s.el" (user-uid)) temporary-file-directory)))
  ;;(load custom-file t)
  (load custom-file 'noerror 'nomessage)

#+end_src

Archive: Previous Packagemanagement configuration utilizing native =package.el=.

#+begin_src emacs-lisp :tangle no

  ;;; ARCHIVE
  ;; `package.el' Configuration
  ;; Previous package management system using `package.el'
  ;; Disabled for now, since we are using/experimenting with `straight.el'
  ;; ;; Initialize package sources
  ;; (require 'package)

  ;; (setq package-archives '(("melpa" . "https://melpa.org/packages/")
  ;;                          ("org" . "https://orgmode.org/elpa/")
  ;;                          ("elpa" . "https://elpa.gnu.org/packages/")))

  ;; (package-initialize)
  ;; (unless package-archive-contents
  ;;   (package-refresh-contents))

  ;; ;; Initialize use-package on non-Linux platforms
  ;; (unless (package-installed-p 'use-package)
  ;;   (package-install 'use-package))

  ;; (require 'use-package)
  ;; (setq use-package-always-ensure t)


  ;; Automatic Package updates
  ;; Disabled for now with use of `straight.el'
  ;; (use-package auto-package-update
  ;;   :custom
  ;;   (auto-package-update-interval 7)
  ;;   (auto-package-update-prompt-before-update t)
  ;;   (auto-package-update-hide-results t)
  ;;   :config
  ;;   (auto-package-update-maybe)
  ;;   (auto-package-update-at-time "11:00"))

#+end_src

Footer

#+begin_src emacs-lisp :tangle ./conf/package-management-conf.el

  
;;; Footer


;;; package-management-conf.el ends here
#+end_src

