early-init.el

;; disable package.el -> use instead straight.el (better package management system)
(setq package-enable-at-startup nil)




;;; Footer
