Emacs.org
** Emacs IDE Setup

Header & Commentary

#+begin_src emacs-lisp :tangle ./conf/ide-conf.el :mkdirp yes
  ;;; ide-conf.el --- Emacs IDE Configuration  -*- lexical-binding: t; -*-
  ;; This file is auto generated by Emacs.org

  ;; Author: Erik Almaraz <erik@almarazlabs.com>
  ;; Maintainer: Erik Almaraz <erik@almarazlabs.com>
  ;; Created 2021-12-05 Sat - TBD
  ;; Version: 0.1
  ;; Keywords: Emacs, .emacs, init, Emacs Lisp
  ;; URL: https;//github.com/skribest/dotEmacs

  ;;; Commentary

  ;;; References:
  ;;   [1] 
  ;;   [2] 
  ;;   [3] 

  ;;<=================================================================================================>


  ;;; Code:


#+end_src

Coding & Editing System Configuration

#+begin_src emacs-lisp :tangle ./conf/ide-conf.el

  ;;; Coding & Editing System Configuration
  ;; TODO: Set defconstants for these and/or defcustoms?
  ;;

  ;; Set the coding system to UTF-8 everywhere
  (prefer-coding-system       'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (setq default-buffer-file-coding-system 'utf-8)

  ;; Tab Widths
  (setq-default tab-width 2)

  ;; Use spaces instead of tabs for indentation
  (setq-default indent-tabs-mode nil)

#+end_src

Language Config with =lsp-mode=

#+begin_src emacs-lisp :tangle ./conf/ide-conf.el

  ;;; Languages with "lsp-mode"
  ;; Add Commentary
  (defun def/lsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . def/lsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
    :config
    (lsp-enable-which-key-integration t))

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))

  ;; Try these commands with =M-x=:
  ;; - =lsp-treemacs-symbols= - Show a tree view of the symbols in the current file
  ;; - =lsp-treemacs-references= - Show a tree view for the references of the symbol under the cursor
  ;; - =lsp-treemacs-error-list= - Show a tree view for the diagnostic messages in the project

  (use-package lsp-treemacs
    :after lsp)

#+end_src

Debugging with =dap-mode=

#+begin_src emacs-lisp :tangle ./conf/ide-conf.el

  ;;; Debugging with `dap-mode'
  (use-package dap-mode
    ;; Uncomment the config below if you want all UI panes to be hidden by default!
    ;; :custom
    ;; (lsp-enable-dap-auto-configure nil)
    ;; :config
    ;; (dap-ui-mode 1)
    :commands dap-debug
    :config
    ;; Set up Node debugging
    (require 'dap-node)
    (dap-node-setup) ;; Automatically installs Node debug adapter if needed

    ;; Bind `C-c l d` to `dap-hydra` for easy access
    (general-define-key
     :keymaps 'lsp-mode-map
     :prefix lsp-keymap-prefix
     "d" '(dap-hydra t :wk "debugger")))

#+end_src

TypeScript

#+begin_src emacs-lisp :tangle ./conf/ide-conf.el

  ;;; TypeScript
  (use-package typescript-mode
    :mode "\\.ts\\'"
    :hook (typescript-mode . lsp-deferred)
    :config
    (setq typescript-indent-level 2))

  ;; Note: In order for `lsp-mode' to work with TypeScript (and JavaScript)
  ;; you will need to install a language server on your machine. If you have
  ;; Node.js installed, the easiest way to do that is by running the following
  ;; command:
  ;; npm install -g typescript-language-server typescript

#+end_src

Python (Disabled for now)

#+begin_src emacs-lisp :tangle no

  ;;; Python
  ;; Make sure you have `pyls' language server installed before trying
  ;; `lsp-mode'
  (use-package python-mode
    :hook (python-mode . lsp-deferred)
    :custom
    ;; NOTE: Set these if Python 3 is called "python3" on your system!
    ;; (python-shell-interpreter "python3")
    ;; (dap-python-executable "python3")
    (dap-python-debugger 'debugpy)
    :config
    (require 'dap-python))

  ;; You can use `pyvenv' to use `virtualevn' evironments on Emacs.
  (use-package pyvenv
    :after python-mode
    :config
    (pyvenv-mode 1))

#+end_src

 Syntax Checking (TODO - Disabled)

#+begin_src emacs-lisp :tangle no

  ;;; Syntax Checking (TODO)
  ;; Disabled for now...

  ;; (use-package flycheck
  ;;   :after lsp-mode
  ;;   :init (global-flycheck-mode))

#+end_src

Company Mode

#+begin_src emacs-lisp :tangle ./conf/ide-conf.el

  ;;; Company Mode
  (use-package company
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    :bind (:map company-active-map
                ("<tab>" . company-complete-selection))
    (:map lsp-mode-map
          ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

  (use-package company-box
    :hook (company-mode . company-box-mode))

#+end_src

Projectile

#+begin_src emacs-lisp :tangle ./conf/ide-conf.el

  ;;; Projectile
  ;;
  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    ;; NOTE: Set this to the folder where you keep your Git repos!
    (when (file-directory-p "~/Projects/Code")
      (setq projectile-project-search-path '("~/Projects/Code")))
    (setq projectile-switch-project-action #'projectile-dired))

  (use-package counsel-projectile
    :after projectile
    :config (counsel-projectile-mode))

#+end_src

Magit

#+begin_src emacs-lisp :tangle ./conf/ide-conf.el

  ;;; Magit
  ;; The best Git interface I've ever used.
  (use-package magit
    :commands magit-status
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
    :config
    (setq magit-clone-always-transient nil)
    )

  ;; NOTE: Make sure to configure a GitHub token before using this package!
  ;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
  ;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
  (use-package forge
    :after magit)

#+end_src

Commenting & Rainbow Delimiters

#+begin_src emacs-lisp :tangle ./conf/ide-conf.el

  ;;; Commenting
  ;; This program can be used without evil-mode!
  (use-package evil-nerd-commenter
    :bind ("M-/" . evilnc-comment-or-uncomment-lines))


  ;;; Rainbow Delimiters
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

Blamer (disabled)

#+begin_src emacs-lisp :tangle ./conf/ide-conf.el

  ;;; Blamer
  ;; Disabled for now
  ;; (use-package blamer
  ;;   :defer 20
  ;;   :custom
  ;;   (blamer-idle-time 0.3)
  ;;   (blamer-min-offset 70)
  ;;   :custom-face
  ;;   (blamer-face ((t :foreground "#7a88cf"
  ;;                    :background nil
  ;;                    :height 120 ;140
  ;;                    :italic t)))
  ;;   :config
  ;;   (global-blamer-mode 1))

#+end_src

Footer

#+begin_src emacs-lisp :tangle ./conf/ide-conf.el

  ;;; Footer

  
  ;;; ide-conf.el ends here
#+end_src

* Org Configuration

