Emacs.org
** Setup Org Mode

Header & Commentary

#+begin_src emacs-lisp :tangle ./conf/org-conf.el :mkdirp yes
  ;;; org-conf.el --- Emacs Org Configuration  -*- lexical-binding: t; -*-
  ;; This file is auto generated by Emacs.org

  ;; Author: Erik Almaraz <erik@almarazlabs.com>
  ;; Maintainer: Erik Almaraz <erik@almarazlabs.com>
  ;; Created 2021-12-05 Sun
  ;; Version: 0.1
  ;; Keywords: Emacs, .emacs, init, Emacs Lisp
  ;; URL: https;//github.com/skribest/dotEmacs

  ;; Commentary

  ;;; References:

  ;;   [1] 
  ;;   [2] 
  ;;   [3] 

  ;;<=================================================================================================>


  ;;; Code:


#+end_src

Font Faces

#+begin_src emacs-lisp :tangle ./conf/org-conf.el

  ;;; Font Faces
  (defun def/org-font-setup ()
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil
                          :font def/default-variable-font-family
                          :weight 'regular
                          :height (cdr face)))

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))


#+end_src

Basic Org Configuration

#+begin_src emacs-lisp :tangle ./conf/org-conf.el

  ;;; Basic Org Configuration
  (defun def/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1))

  (use-package org
    ;;:pin org ; This does not work for some reasion using straight.el
    :commands (org-capture org-agenda)
    :hook (org-mode . def/org-mode-setup)
    :config
    (setq org-ellipsis " ▾")
    (setq org-goto-auto-isearch nil) ;; this is a test to try org-goto function...
    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)
    (setq org-toggle-pretty-entities t) ;; Always set to true, I do a lot of latex manuscript writting

    (setq org-refile-targest
          '(("Archive.org" :maxlevel . 1)))
    ;; Save Org Buffers after refiling!
    (advice-add 'org-refile :after 'org-save-all-org-buffers)

    ;; For some reason defvar's are working here... why?
    (setq org-agenda-files
          '((concat def/org-agenda-dir "Tasks.org")
            (concat def/org-agenda-dir "Journal.org")
            (concat def/org-agenda-dir "Metabox.org")
            (concat def/org-agenda-dir "Birthdays.org")
            (concat def/org-agenda-dir "Habits.org")
            ))

    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    (setq org-habit-graph-column 60)

    (setq org-todo-keywords
          '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
            (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)"
                      "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)"
                      "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

    (setq org-refile-targets
          '(("Archive.org" :maxlevel . 1)
            ("Tasks.org"   :maxlevel . 1)
            ("Journal.org" :maxlevel . 1)))

    ;; Save Org buffers after refiling!
    (advice-add 'org-refile :after 'org-save-all-org-buffers)

    (setq org-tag-alist
          '((:startgroup)
                                          ; Put mutually exclusive tags here
            (:endgroup)
            ("@errand"  . ?E)
            ("@home"    . ?H)
            ("@work"    . ?W)
            ("agenda"   . ?a)
            ("planning" . ?p)
            ("publish"  . ?P)
            ("batch"    . ?b)
            ("note"     . ?n)
            ("idea"     . ?i)))

    ;; Configure custom agenda views
    (setq org-agenda-custom-commands
          '(("d" "Dashboard"
             ((agenda "" ((org-deadline-warning-days 7)))
              (todo "NEXT"
                    ((org-agenda-overriding-header "Next Tasks")))
              (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

            ("n" "Next Tasks"
             ((todo "NEXT"
                    ((org-agenda-overriding-header "Next Tasks")))))

            ("W" "Work Tasks" tags-todo "+work-email")

            ;; Low-effort next actions
            ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
             ((org-agenda-overriding-header "Low Effort Tasks")
              (org-agenda-max-todos 20)
              (org-agenda-files org-agenda-files)))

            ("w" "Workflow Status"
             ((todo "WAIT"
                    ((org-agenda-overriding-header "Waiting on External")
                     (org-agenda-files org-agenda-files)))
              (todo "REVIEW"
                    ((org-agenda-overriding-header "In Review")
                     (org-agenda-files org-agenda-files)))
              (todo "PLAN"
                    ((org-agenda-overriding-header "In Planning")
                     (org-agenda-todo-list-sublevels nil)
                     (org-agenda-files org-agenda-files)))
              (todo "BACKLOG"
                    ((org-agenda-overriding-header "Project Backlog")
                     (org-agenda-todo-list-sublevels nil)
                     (org-agenda-files org-agenda-files)))
              (todo "READY"
                    ((org-agenda-overriding-header "Ready for Work")
                     (org-agenda-files org-agenda-files)))
              (todo "ACTIVE"
                    ((org-agenda-overriding-header "Active Projects")
                     (org-agenda-files org-agenda-files)))
              (todo "COMPLETED"
                    ((org-agenda-overriding-header "Completed Projects")
                     (org-agenda-files org-agenda-files)))
              (todo "CANC"
                    ((org-agenda-overriding-header "Cancelled Projects")
                     (org-agenda-files org-agenda-files)))))))

    ;; Config Org Capture Templates
    (setq org-capture-templates
          `(
            ("t" "Tasks / Projects")
            ("tt" "Task" entry
             (file+olp "~/.emacs.d/OrgFiles/agenda/Tasks.org" "Inbox")
             "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

            ("j" "Journal Entries")
            ("jj" "Journal" entry
             (file+olp+datetree "~/.emacs.d/OrgFiles/Agenda/Journal.org")
             "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
             ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
             :clock-in :clock-resume
             :empty-lines 1)

            ("jm" "Meeting" entry
             (file+olp+datetree  "~/.emacs.d/OrgFiles/Agenda/Journal.org")
             "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
             :clock-in :clock-resume
             :empty-lines 1)

            ("w" "Workflows")
            ("we" "Checking Email" entry
             (file+olp+datetree  "~/.emacs.d/OrgFiles/Agenda/Journal.org")
             "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1)

            ("m" "Metrics Capture")
            ("mw" "Weight" table-line
             (file+headline "~/.emacs.d/OrgFiles/Agenda/Metrics.org" "Weight")
             "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t)
            )
          )

    (define-key global-map (kbd "C-c j")
      (lambda () (interactive) (org-capture nil "jj")))

    (define-key global-map (kbd "C-c m")
      (lambda () (interactive) (org-capture nil "mw")))

    (def/org-font-setup)
    );; end use-package Org


#+end_src

Heading Bullets

#+begin_src emacs-lisp :tangle ./conf/org-conf.el

  ;;; Nicer Heading Bullets
  ;;
  (use-package org-bullets
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

#+end_src

Center Org Buffer and set =visual-fill-column=

#+begin_src emacs-lisp :tangle ./conf/org-conf.el

  ;;; Center Org Buffers
  ;;
  (defun def/org-mode-visual-fill ()
    (setq visual-fill-column-width 107
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . def/org-mode-visual-fill))

#+end_src

Footer

#+begin_src emacs-lisp :tangle ./conf/org-conf.el

  ;;; Footer


  ;;; org-conf.el ends here
#+end_src

** Org Babel

Header & Commentary

#+begin_src emacs-lisp :tangle ./conf/babel-conf.el :mkdirp yes
  ;;; babel-conf.el --- Emacs Org Babel Configuration
  ;; This file is auto generated by Emacs.org

  ;; Author: Erik Almaraz <erik@almarazlabs.com>
  ;; Maintainer: Erik Almaraz <erik@almarazlabs.com>
  ;; Created 2021-12-05 Sun
  ;; Version: 0.1
  ;; Keywords: Emacs, .emacs, init, Emacs Lisp
  ;; URL: https;//github.com/skribest/dotEmacs

  ;;; Commentary

  ;;; References:

  ;;   [1] 
  ;;   [2] 
  ;;   [3] 

  ;;<=================================================================================================>


  ;;; Code:


#+end_src

Babel Initialization

#+begin_src emacs-lisp :tangle ./conf/babel-conf.el

  ;;; Initialization
  (with-eval-after-load 'org
    (org-babel-do-load-languages
     'org-babel-load-languages
     '(
       (emacs-lisp . t)
       ;; Disable for now
       (scheme . nil)
       (python . nil)
       (shell . nil)
       ))
    (push '("conf-unix" . conf-unix) org-src-lang-modes)
    (setq org-confirm-babel-evaluate nil))

#+end_src

Structure Templates

#+begin_src emacs-lisp :tangle ./conf/babel-conf.el

  ;;; Structure Templates
  (with-eval-after-load 'org
    ;; This is needed as of Org 9.2
    (require 'org-tempo)

    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("scm" . "src scheme"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("sh" . "src shell")))

#+end_src

Guile Scheme REPL Configuration

#+begin_src emacs-lisp :tangle ./conf/babel-conf.el

  ;;; Guile Scheme REPL Configuration
  ;;
  (use-package geiser
    :if (not def/work)
    :hook (scheme-mode-hook . geiser-mode)
    :config
    (geiser-default-implementation 'guile)
    (geiser-repl-use-other-window nil))

  (use-package geiser-guile
    :if (not def/work)
    :after geiser)

#+end_src

Babel Auto-Tangle Select Files

#+begin_src emacs-lisp :tangle ./conf/babel-conf.el

  ;;; Auto-Tangle Select Files

  ;; Automatically tangle our Emacs.org config file when we save it
  (defun def/org-babel-tangle-config ()
    (when (string-equal (file-name-directory
                         (buffer-file-name))
                        (expand-file-name def/user-emacs-directory))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))
      ))

  ;; Automatically tangle Literate Programming files when we save them
  (defun def/org-babel-tangle-literate ()
    (when (string-equal (file-name-directory (buffer-file-name))
                        (expand-file-name def/lp-dir))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))
      ))

  (add-hook 'org-mode-hook
            (lambda () (add-hook 'after-save-hook
                                 #'def/org-babel-tangle-config)))

  (add-hook 'org-mode-hook
            (lambda () (add-hook 'after-save-hook
                                 #'def/org-babel-tangle-literate)))

#+end_src

Footer

#+begin_src emacs-lisp :tangle ./conf/babel-conf.el

  ;;; Footer

  ;;; babel-conf.el ends here
#+end_src

