init.el

;;; Runtime Performance
;; Make gc pauses faster by decreasing the threshold.
(setq gc-cons-threshold (* 2 1000 1000))
;;(add-hook 'focus-out-hook #'garbage-collect)




;;; Footer


;;; init.el ends here
